app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "teste2"], ["text", "edittest"], ["updated_at", 2017-03-21 20:53:53 UTC], ["id", 2]]