app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "Leoxxid"], ["body", "Nice job!"], ["article_id", 1], ["created_at", 2017-03-22 05:19:42 UTC], ["updated_at", 2017-03-22 05:19:42 UTC]]
---
  def create
    @article = Article.find(params[:article_id])
    @coment = @article.comments.create(comment_params)